import React, {Component} from 'react';
import './CssBase.css';

class CssBase extends Component {

    render() {
        return (
            <div>
                <h1>Css基础</h1>
                <h2>元素-子孙选择器</h2>
                <p>选择器包括：元素选择器、类选择器、ID选择器、元素-子孙选择器、ID-子孙选择器</p>
                <p className="green">类选择器...类选择器...类选择器...类选择器... </p>
                <p className="blue"> 类选择器...类选择器...类选择器...类选择器...类选择器...类选择器...... </p>
                <p id="dream">
                    类选择器...<em>ID-子孙选择器</em>类选择器<code>ID-直接选择-子孙选择器</code>
                </p>
                <p id="link">
                    有什么事情，找<a href="https://www.baidu.com/">度娘</a>啊
                </p>

                <div id="div">

                <p className="FontColorSize FontSizePercent FontSizeEm FontSizeKeyword">
                    字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|
                    字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|
                    字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|
                    字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|字体|颜色|大小|粗细|风格|
                </p>


                <p className="BoxModel">
                    盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型
                    盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型
                    盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型
                    盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型
                    盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型
                    盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型盒模型
                </p>
                </div>

            </div>
        );
    }

}

export default CssBase;